app/controllers/statistic_controller.rb

SELECT  `analysis_info`.* FROM `analysis_info`   ORDER BY `analysis_info`.`id` DESC LIMIT 1
---
  def index
   @ai = AnalysisInfo.last