app/controllers/userhost_controller.rb

  def addhost
    @info = "提交成功，我们会尽快更新（一般5分钟内会自动更新，最长第二天能完成）！"
    @error = false
    @host = params['host']
    @rawurl = @host
    @host = host_of_url(@host)
    #render :text => @host
    url = Domainatrix.parse(@host)
    if url.domain.size>0 && url.public_suffix
      @userhost = Userhost.create("host"=>@host, "clientip"=>request.env['HTTP_X_FORWARDED_FOR'] || request.remote_ip )
---
INSERT INTO `userhost` (`clientip`, `host`) VALUES ('127.0.0.1', 'oa.qihoo.net')